<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Box Edit Installer disk image and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.triti.pkg.BoxEdit</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BoxEdit</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.boxedit</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
					<key>Library</key>
					<string>01775</string>
					<key>Library/Internet Plug-Ins</key>
					<string>0755</string>
					<key>Library/LaunchAgents</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%app_name%/Contents/Resources/Box Edit.app</string>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Box Edit.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/%app_name%/Contents/Resources/Box Edit.plugin</string>
				<key>destination_path</key>
				<string>%pkgroot%/Library/Internet Plug-Ins/Box Edit.plugin</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_DIR%/com.box.BoxEditLaunch.plist</string>
				<key>destination_path</key>
				<string>%pkgroot%/Library/LaunchAgents/com.box.BoxEditLaunch.plist</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>id</key>
					<string>com.box.BoxEditInstaller</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
						<dict>
							<key>path</key>
							<string>Library</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
					<key>scripts</key>
					<string>Scripts</string>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
