<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of the Mumble VoIP Client.</string>
	<key>Identifier</key>
	<string>com.github.triti.download.Mumble</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mumble</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>mumble-voip/mumble</string>
				<key>asset_regex</key>
				<string>Mumble-\d+\.\d+\.\d+\.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>