<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and installs the latest ADPassMon utility.</string>
	<key>Identifier</key>
	<string>com.github.triti.install.ADPassMon</string>
	<key>Input</key>
	<dict>
		<key>INSTALL_DIR</key>
		<string>/Applications</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.ADPassMon</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%INSTALL_DIR%</string>
				<key>purge_destination</key>
				<false/>
			</dict>
		</dict>
	</array>
</dict>
</plist>
