<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DeployStudio and installs the Admin installer package.</string>
	<key>Identifier</key>
	<string>com.github.triti.install.DeployStudioAdmin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DeployStudioAdmin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.download.DeployStudio</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Installer</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%/DeployStudioServer_v%version%.mpkg/Contents/Packages/deploystudioAdmin.pkg</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>